{
  "#": {
    "renderer": "RedirectRenderer",
    "model": "#Welcome%20to%20SwimVeg"
  },
  "#Options": {
    "renderer": "OptionsRenderer"
  },
  "#PageList": {
    "renderer": "PageListRenderer"
  },      
  "#Welcome%20to%20SwimVeg": {
    "model": {
      "body": "<p>Welcome to Swimming Vegetable, an extremely basic HTML5 application focused on note taking and keyboard text input. There are already several good web-based text editors out there, but I build SwimVeg with a few objectives in mind:</p><ol><li><b>Simplicity.</b> You type words, SwimVeg saves them on your local system. I may add the ability to import images or do network synchronization later, but not if it takes away from the focus on words and simplicity.</li><li><b>Resiliance.</b> SwimVeg uses the HTML5 Application Cache to encourage modern browsers to not freak out when you lose network connectivity.</li><li><b>Keyboard Focus.</b> I type quite a few words each day. And while I love tablet computers and smart phones, most of my interaction with the net is via text entered with a keyboard. My objective is to have a fully usable text editor that does not require the use of a mouse.</li></ol><p>If you want to use SwimVeg, you <i><b>should</b></i> be able to overwrite these words with your own. <b>Just start typing.</b> Remember, SwimVeg stores the text you type on <i><b>your computer</b></i>. Don't type things on other people's computers you don't want them to see. Also keep in mind this is <b>BETA SOFTWARE</b>; it will break at least once on you.</p><p><b>Okay... What Now?</b></p><p>Great! You're still here! We inherit basic text editing keystrokes from your browser, but these are the keystrokes we added:</p><table class=\"table table-bordered\"><tr><td class=\"key\"><b>Ctrl-D</b></td><td><b>Forward Delete.</b> This keystroke deletes the character in front of the cursor.</td></tr><tr><td><b>Ctrl-L Ctrl-A</b></td><td><b>Select Link.</b> If your cursor is on a link, this keystroke will cause the entire link text to be selected.</td></tr><tr><td><b>Ctrl-L Ctrl-C</b></td><td><b>Copy Link Target.</b> If your cursor is on a link, this keystroke copies the URL it links to into the clipboard.</td></tr><tr><td><b>Ctrl-L Ctrl-L</b></td><td><b>Create a Link.</b> Select some text and press Ctrl-L twice to create a link to a new page.</td></tr><tr><td><b>Ctrl-L Ctrl-V</b></td><td><b>Paste a URL into a link.</b> If the cursor is in a link, this keystroke changes the URL it points to to the contents of the clipboard.</td></tr><tr><td><b>Ctrl-O</b></td><td><b>Open Page.</b> Pressing Ctrl-O opens a list of pages.</td></tr><tr><td><b>Ctrl-S</b></td><td><b>Save Current Page.</b> Pressing Ctrl-S saves the text of the current page to your browser's local storage.</td></tr></table><p>These are just a few to get you started. A more complete list of keystrokes can be found on the <a href=\"#Help\">Help</a> page. There's also a <a href=\"#FAQ\">Frequently Asked Questions</a> page that <i>may</i> have an answer you're looking for.</p>"
    }
  },
  "#Help": {
    "model": {
      "body": "<p>Someday there will be a really cool online help system here. But for now, we just have a few tables.</p><p>Here's the list of SwimVeg specific keystrokes again:</p><table class=\"table table-bordered\"><tr><td class=\"key\"><b>Ctrl-D</b></td><td><b>Forward Delete.</b> This keystroke deletes the character in front of the cursor.</td></tr><tr><td><b>Ctrl-L Ctrl-A</b></td><td><b>Select Link.</b> If your cursor is on a link, this keystroke will cause the entire link text to be selected.</td></tr><tr><td><b>Ctrl-L Ctrl-C</b></td><td><b>Copy Link Target.</b> If your cursor is on a link, this keystroke copies the URL it links to into the clipboard.</td></tr><tr><td><b>Ctrl-L Ctrl-L</b></td><td><b>Create a Link.</b> Select some text and press Ctrl-L twice to create a link to a new page.</td></tr><tr><td><b>Ctrl-L Ctrl-V</b></td><td><b>Paste a URL into a link.</b> If the cursor is in a link, this keystroke changes the URL it points to to the contents of the clipboard.</td></tr><tr><td><b>Ctrl-O</b></td><td><b>Open Page.</b> Pressing Ctrl-O opens a list of pages.</td></tr><tr><td><b>Ctrl-S</b></td><td><b>Save Current Page.</b> Pressing Ctrl-S saves the text of the current page to your browser's local storage.</td></tr></table><p>And here's the canonical list of keystrokes we inherit from your browser:</p><table class=\"table table-bordered\"><tr><td class=\"key\"><b>Ctrl-A</b></td><td>Select All</td></tr><tr><td><b>Ctrl-B</b></td><td>Toggle <b>Bold</b> Mode</td></tr><tr><td><b>Ctrl-C</b></td><td>Copy</td></tr><tr><td><b>Ctrl-F</b></td><td>Find on Page</td></tr><tr><td><b>Ctrl-G</b></td><td>Find Again</td></tr><tr><td><b>Ctrl-I</b></td><td>Toggle <i>Italic</i> Mode</td></tr><tr><td><b>Ctrl-P</b></td><td>Print</td></tr><tr><td><b>Ctrl-U</b></td><td>Toggle <u>Underline</i> Mode</td></tr><tr><td><b>Ctrl-V</b></td><td>Paste</td></tr><tr><td><b>Ctrl-X</b></td><td>Cut</td></tr><tr><td><b>Ctrl-Z</b></td><td>Undo</td></tr></table>"
    }
  },
  "#FAQ": {
    "model": {
      "title": "Frequently Asked Questions",
      "body": "<p>Here are a few questions I've been asked. Feel free to ping me at <a href=\"mailto:OhMeadhbh@gmail.com\">OhMeadhbh@gmail.com</a> if you have any others.</p><ol><li><b>Do you really not have &lt;some feature&gt;?</b> Yes. I'm being pretty charitable when I call this code \"beta.\" It's more like alpha quality. So there are a LOT of features not here.</li><li><b>What kind of name is \"Swimming Vegetable\"?</b> The name is an homage to <a href=\"http://flyingmeat.com/\">Flying Meat Software</a>, who make a product for the Macintosh(tm) called VooDooPad(tm). It was the first half-way usable \"local wiki\" I encountered. Don't confuse SwimVeg with VooDooPad though; they really are different critters. But if you have a Macintosh and need something with better Rich Text support, I recommend VooDooPad.</li><li><b>Control-Z doesn't undo inserting timestamps.</b> Yes, known bug. Will be fixed eventually.</li></ol>" 
    }
  },
  "#License%20Info": {
    "model": {
      "body": "<p>The software and initial contents of this package are the copyrighted intellectual property of Meadhbh S. Hamrick but are released under a BSD License:</p><pre>Copyright (c) 2009-2013, Meadhbh S. Hamrick\nAll rights reserved. \n\nRedistribution and use in source and binary forms, with or without\nmodification, are permitted provided that the following conditions are\nmet:\n\n * Redistributions of source code must retain the above copyright\n   notice, this list of conditions and the following disclaimer.\n * Redistributions in binary form must reproduce the above copyright\n   notice, this list of conditions and the following disclaimer in the\n   documentation and/or other materials provided with the distribution.\n * Neither the name of Meadhbh S. Hamrick nor the names of its\n   contributors may be used to endorse or promote products derived\n   from this software without specific prior written permission.\n\nTHIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS \"AS\nIS\" AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED\nTO, THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A\nPARTICULAR PURPOSE ARE DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT OWNER\nOR CONTRIBUTORS BE LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL,\nEXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT LIMITED TO,\nPROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR\nPROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF\nLIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING\nNEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF THIS\nSOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.</pre><p>Fonts used with this application are Copyright (c) 2011 Canonical Ltd. and are governed by the <a href=\"fonts/UFL.txt\">Ubuntu Font License</a>. Ubuntu and Canonical are registered trademarks fo Caononical Ltd.</p>",
      "locked": true
    }
  }
}
